tests/Functional/fixtures/task_request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><sendRequestXML xmlns="http://developer.intuit.com/"><ticket>{ticketId}</ticket><strHCPResponse>&lt;?xml version="1.0" ?&gt;
&lt;QBXML&gt;
&lt;QBXMLMsgsRs&gt;
&lt;HostQueryRs requestID="0" statusCode="0" statusSeverity="Info" statusMessage="Status OK"&gt;
&lt;HostRet&gt;
&lt;ProductName&gt;QuickBooks Desktop Pro 2019&lt;/ProductName&gt;
&lt;MajorVersion&gt;29&lt;/MajorVersion&gt;
&lt;MinorVersion&gt;0&lt;/MinorVersion&gt;
&lt;Country&gt;US&lt;/Country&gt;
&lt;SupportedQBXMLVersion&gt;1.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;1.1&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;2.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;2.1&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;3.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;4.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;4.1&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;5.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;6.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;7.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;8.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;9.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;10.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;11.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;12.0&lt;/SupportedQBXMLVersion&gt;
&lt;SupportedQBXMLVersion&gt;13.0&lt;/SupportedQBXMLVersion&gt;
&lt;IsAutomaticLogin&gt;false&lt;/IsAutomaticLogin&gt;
&lt;QBFileMode&gt;SingleUser&lt;/QBFileMode&gt;
&lt;/HostRet&gt;
&lt;/HostQueryRs&gt;
&lt;CompanyQueryRs requestID="1" statusCode="0" statusSeverity="Info" statusMessage="Status OK"&gt;
&lt;CompanyRet&gt;
&lt;IsSampleCompany&gt;false&lt;/IsSampleCompany&gt;
&lt;CompanyName&gt;ACME LIMITED&lt;/CompanyName&gt;
&lt;LegalCompanyName&gt;ACME LIMITED&lt;/LegalCompanyName&gt;
&lt;Address&gt;
&lt;Addr1&gt;1104A, Kai Tak Comm Bld, &lt;/Addr1&gt;
&lt;Addr2&gt;317-319 Des Voeux Rd. Central&lt;/Addr2&gt;
&lt;City&gt;Hong Kong&lt;/City&gt;
&lt;PostalCode&gt;999077&lt;/PostalCode&gt;
&lt;Country&gt;Other&lt;/Country&gt;
&lt;/Address&gt;
&lt;AddressBlock&gt;
&lt;Addr1&gt;1104A, Kai Tak Comm Bld,&lt;/Addr1&gt;
&lt;Addr2&gt;317-319 Des Voeux Rd. Central&lt;/Addr2&gt;
&lt;Addr3&gt;Hong Kong, 999077&lt;/Addr3&gt;
&lt;/AddressBlock&gt;
&lt;LegalAddress&gt;
&lt;Addr1&gt;1104A, Kai Tak Comm Bld,&lt;/Addr1&gt;
&lt;Addr2&gt;317-319 Des Voeux Rd. Central&lt;/Addr2&gt;
&lt;City&gt;Hong Kong&lt;/City&gt;
&lt;PostalCode&gt;999077&lt;/PostalCode&gt;
&lt;Country&gt;US&lt;/Country&gt;
&lt;/LegalAddress&gt;
&lt;Email&gt;info@acme.com&lt;/Email&gt;
&lt;FirstMonthFiscalYear&gt;January&lt;/FirstMonthFiscalYear&gt;
&lt;FirstMonthIncomeTaxYear&gt;January&lt;/FirstMonthIncomeTaxYear&gt;
&lt;CompanyType&gt;InformationTechnologyComputersSoftware&lt;/CompanyType&gt;
&lt;TaxForm&gt;Form1065&lt;/TaxForm&gt;
&lt;SubscribedServices&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Banking&lt;/Name&gt;
&lt;Domain&gt;banking.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Billing&lt;/Name&gt;
&lt;Domain&gt;billing.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Billing Level 1 Service&lt;/Name&gt;
&lt;Domain&gt;qbob1.qbn&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Billing Level 2 Service&lt;/Name&gt;
&lt;Domain&gt;qbob2.qbn&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Billing Payment Service&lt;/Name&gt;
&lt;Domain&gt;qbobpay.qbn&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Bill Payment&lt;/Name&gt;
&lt;Domain&gt;billpay.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Online Billing Paper Mailing Service&lt;/Name&gt;
&lt;Domain&gt;qbobpaper.qbn&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Payroll Service&lt;/Name&gt;
&lt;Domain&gt;payroll.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Basic Payroll Service&lt;/Name&gt;
&lt;Domain&gt;payrollbsc.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Basic Disk Payroll Service&lt;/Name&gt;
&lt;Domain&gt;payrollbscdisk.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Deluxe Payroll Service&lt;/Name&gt;
&lt;Domain&gt;payrolldlx.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;QuickBooks Premier Payroll Service&lt;/Name&gt;
&lt;Domain&gt;payrollprm.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;Basic Plus Federal&lt;/Name&gt;
&lt;Domain&gt;basic_plus_fed.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;Basic Plus Federal and State&lt;/Name&gt;
&lt;Domain&gt;basic_plus_fed_state.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;Basic Plus Direct Deposit&lt;/Name&gt;
&lt;Domain&gt;basic_plus_dd.qb&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;Service&gt;
&lt;Name&gt;Merchant Account Service&lt;/Name&gt;
&lt;Domain&gt;mas.qbn&lt;/Domain&gt;
&lt;ServiceStatus&gt;Never&lt;/ServiceStatus&gt;
&lt;/Service&gt;
&lt;/SubscribedServices&gt;
&lt;AccountantCopy&gt;
&lt;AccountantCopyExists&gt;false&lt;/AccountantCopyExists&gt;
&lt;/AccountantCopy&gt;
&lt;DataExtRet&gt;
&lt;OwnerID&gt;{0e77aa8a-0e9c-a864-41a7-4aa4f63858ab}&lt;/OwnerID&gt;
&lt;DataExtName&gt;AppLock&lt;/DataExtName&gt;
&lt;DataExtType&gt;STR255TYPE&lt;/DataExtType&gt;
&lt;DataExtValue&gt;LOCKED:WIN-KDMFU3DFTBK:636965595837848585&lt;/DataExtValue&gt;
&lt;/DataExtRet&gt;
&lt;DataExtRet&gt;
&lt;OwnerID&gt;{0e77aa8a-0e9c-a864-41a7-4aa4f63858ab}&lt;/OwnerID&gt;
&lt;DataExtName&gt;FileID&lt;/DataExtName&gt;
&lt;DataExtType&gt;STR255TYPE&lt;/DataExtType&gt;
&lt;DataExtValue&gt;{7e113158-25d1-2004-4d47-a62929e377f2}&lt;/DataExtValue&gt;
&lt;/DataExtRet&gt;
&lt;/CompanyRet&gt;
&lt;/CompanyQueryRs&gt;
&lt;PreferencesQueryRs requestID="2" statusCode="0" statusSeverity="Info" statusMessage="Status OK"&gt;
&lt;PreferencesRet&gt;
&lt;AccountingPreferences&gt;
&lt;IsUsingAccountNumbers&gt;false&lt;/IsUsingAccountNumbers&gt;
&lt;IsRequiringAccounts&gt;true&lt;/IsRequiringAccounts&gt;
&lt;IsUsingClassTracking&gt;false&lt;/IsUsingClassTracking&gt;
&lt;IsUsingAuditTrail&gt;true&lt;/IsUsingAuditTrail&gt;
&lt;IsAssigningJournalEntryNumbers&gt;true&lt;/IsAssigningJournalEntryNumbers&gt;
&lt;/AccountingPreferences&gt;
&lt;FinanceChargePreferences&gt;
&lt;AnnualInterestRate&gt;0.00&lt;/AnnualInterestRate&gt;
&lt;MinFinanceCharge&gt;0.00&lt;/MinFinanceCharge&gt;
&lt;GracePeriod&gt;0&lt;/GracePeriod&gt;
&lt;IsAssessingForOverdueCharges&gt;false&lt;/IsAssessingForOverdueCharges&gt;
&lt;CalculateChargesFrom&gt;DueDate&lt;/CalculateChargesFrom&gt;
&lt;IsMarkedToBePrinted&gt;false&lt;/IsMarkedToBePrinted&gt;
&lt;/FinanceChargePreferences&gt;
&lt;JobsAndEstimatesPreferences&gt;
&lt;IsUsingEstimates&gt;true&lt;/IsUsingEstimates&gt;
&lt;IsUsingProgressInvoicing&gt;false&lt;/IsUsingProgressInvoicing&gt;
&lt;IsPrintingItemsWithZeroAmounts&gt;false&lt;/IsPrintingItemsWithZeroAmounts&gt;
&lt;/JobsAndEstimatesPreferences&gt;
&lt;MultiCurrencyPreferences&gt;
&lt;IsMultiCurrencyOn&gt;true&lt;/IsMultiCurrencyOn&gt;
&lt;HomeCurrencyRef&gt;
&lt;ListID&gt;8000003F-1560777868&lt;/ListID&gt;
&lt;FullName&gt;Hong Kong Dollar&lt;/FullName&gt;
&lt;/HomeCurrencyRef&gt;
&lt;/MultiCurrencyPreferences&gt;
&lt;MultiLocationInventoryPreferences&gt;
&lt;IsMultiLocationInventoryAvailable&gt;false&lt;/IsMultiLocationInventoryAvailable&gt;
&lt;IsMultiLocationInventoryEnabled&gt;false&lt;/IsMultiLocationInventoryEnabled&gt;
&lt;/MultiLocationInventoryPreferences&gt;
&lt;PurchasesAndVendorsPreferences&gt;
&lt;IsUsingInventory&gt;false&lt;/IsUsingInventory&gt;
&lt;DaysBillsAreDue&gt;10&lt;/DaysBillsAreDue&gt;
&lt;IsAutomaticallyUsingDiscounts&gt;false&lt;/IsAutomaticallyUsingDiscounts&gt;
&lt;/PurchasesAndVendorsPreferences&gt;
&lt;ReportsPreferences&gt;
&lt;AgingReportBasis&gt;AgeFromDueDate&lt;/AgingReportBasis&gt;
&lt;SummaryReportBasis&gt;Accrual&lt;/SummaryReportBasis&gt;
&lt;/ReportsPreferences&gt;
&lt;SalesAndCustomersPreferences&gt;
&lt;IsTrackingReimbursedExpensesAsIncome&gt;false&lt;/IsTrackingReimbursedExpensesAsIncome&gt;
&lt;IsAutoApplyingPayments&gt;true&lt;/IsAutoApplyingPayments&gt;
&lt;PriceLevels&gt;
&lt;IsUsingPriceLevels&gt;true&lt;/IsUsingPriceLevels&gt;
&lt;IsRoundingSalesPriceUp&gt;true&lt;/IsRoundingSalesPriceUp&gt;
&lt;/PriceLevels&gt;
&lt;/SalesAndCustomersPreferences&gt;
&lt;TimeTrackingPreferences&gt;
&lt;FirstDayOfWeek&gt;Monday&lt;/FirstDayOfWeek&gt;
&lt;/TimeTrackingPreferences&gt;
&lt;CurrentAppAccessRights&gt;
&lt;IsAutomaticLoginAllowed&gt;false&lt;/IsAutomaticLoginAllowed&gt;
&lt;IsPersonalDataAccessAllowed&gt;false&lt;/IsPersonalDataAccessAllowed&gt;
&lt;/CurrentAppAccessRights&gt;
&lt;ItemsAndInventoryPreferences&gt;
&lt;EnhancedInventoryReceivingEnabled&gt;false&lt;/EnhancedInventoryReceivingEnabled&gt;
&lt;IsTrackingSerialOrLotNumber&gt;None&lt;/IsTrackingSerialOrLotNumber&gt;
&lt;FIFOEnabled&gt;false&lt;/FIFOEnabled&gt;
&lt;IsRSBEnabled&gt;false&lt;/IsRSBEnabled&gt;
&lt;IsBarcodeEnabled&gt;false&lt;/IsBarcodeEnabled&gt;
&lt;/ItemsAndInventoryPreferences&gt;
&lt;/PreferencesRet&gt;
&lt;/PreferencesQueryRs&gt;
&lt;/QBXMLMsgsRs&gt;
&lt;/QBXML&gt;
</strHCPResponse><strCompanyFileName>C:\Users\Public\Documents\Intuit\QuickBooks\Company Files\ACME LIMITED.qbw</strCompanyFileName><qbXMLCountry>US</qbXMLCountry><qbXMLMajorVers>13</qbXMLMajorVers><qbXMLMinorVers>0</qbXMLMinorVers></sendRequestXML></soap:Body></soap:Envelope>