payload.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <authenticate xmlns="http://developer.intuit.com/">
         <strUserName>easycomputer</strUserName>
         <strPassword>seswakibodi</strPassword>
      </authenticate>
   </soap:Body>
</soap:Envelope>